// creating an array and passing the number, questions, options, and answers
let questions = [
    {
    numb: 1,
    question: "ഇങ്ക്സ്കേപ്പിൽ ഒരു ഒബ്ജക്ടിന് നൽകിയ നിറത്തിന് കടുപ്പം കുറയ്ക്കാൻ എന്താണ് ചെയ്യേണ്ടത്?",
    answer: "ഒബ്ജക്ടിന്റെ Opacity യുടെ അളവിൽ കുറവ് വരുത്തിയാൽ മതി.",
    options: [
      "ഒബ്ജക്ടിന്റെ Opacity യുടെ അളവ് കൂട്ടിയാൽ",
      "ഒബ്ജക്ടിന്റെ Opacity യുടെ അളവിൽ കുറവ് വരുത്തിയാൽ മതി.",
      "ഒബ്ജക്ട് വലുതാക്കിയാൽ മതി.",
      "ഒബ്ജക്ടിന്റെ സ്ട്രോക്കിന്റെ അളവ് കുറവ് വരുത്തിയാൽ മതി."
    ]
  },
    {
    numb: 2,
    question: "ഇങ്ക്സ്കേപ് സോഫ്റ്റ് വെയറിൽ ഒബ്ജക്ടുകളുടെ Path ൽ വ്യത്യാസം വരുത്താൻ ഉപയോഗിക്കുന്ന ടൂൾ ഏതാണ്?",
    answer: "Edit path by nodes",
    options: [
      "Create sporals",
      "Draw freehand lines",
      "Edit path by nodes",
      "Draw Bezier curves and Straight lines"
    ]
  },
    {
    numb: 3,
    question: "ഒരു പ്രൊജക്ട് റിപ്പോർട്ട് വേഡ് പ്രൊസസ്സറിൽ തയ്യാറാക്കി. അതിലെ ഉള്ളടക്കപ്പട്ടികയുള്ള പേജിൽ നിന്ന് ഉള്ളടക്കത്തിലേക്ക് എളുപ്പം പോകുന്നതിന് താഴെ തന്നിരിക്കുന്നവയിൽ ഏത് ഉപയോഗിക്കാം?",
    answer: "ctrl കീ അമർത്തിപ്പിടിച്ചു കൊണ്ട് ശീർഷകത്തിൽ ക്ലിക്ക് ചെയ്യുക.",
    options: [
      "ctrl കീ അമർത്തിപ്പിടിച്ചു കൊണ്ട് ശീർഷകത്തിൽ ക്ലിക്ക് ചെയ്യുക.",
      "Shift കീ അമർത്തിപ്പിടിച്ചു കൊണ്ട് ശീർഷകത്തിൽ ക്ലിക്ക് ചെയ്യുക.",
      "F1 കീ അമർത്തിപ്പിടിച്ചു കൊണ്ട് ശീർഷകത്തിൽ ക്ലിക്ക് ചെയ്യുക.",
      "Enter കീ അമർത്തിപ്പിടിച്ചു കൊണ്ട് ശീർഷകത്തിൽ ക്ലിക്ക് ചെയ്യുക."
    ]
  },
    {
    numb: 4,
    question: "Synfig Studio സോഫ്റ്റ് വെയർ ഉപയോ​ഗിച്ച് തയ്യാറാക്കുന്ന ഫയലുകളുടെ തനതു ഫയൽ ഫോർമാറ്റ് ഏതാണ്?",
    answer: "sifz",
    options: [
      "sifz",
      "odt",
      "svg",
      "xcf"
    ]
  },
    {
    numb: 5,
    question: "ഇങ്ക്സേപ്പിൽ ഒരു ചിത്രം തയ്യാറാക്കി school എന്ന പേരിൽ save ചെയ്താൽ ഫയൽ താഴെ തന്നിരിക്കുന്നവയിൽ ഏതാണ്?",
    answer: "pencolor(“blue”)",
    options: [
      "School.png",
      "School.jpg",
      "School.svg",
      "School.xcf"
    ]
  },
  {
    numb: 6,
    question: "നിശ്ചലദൃശ്യങ്ങൾ, തുടർച്ചയായും വേ​ഗത്തിലും പ്രദർശിപ്പിക്കുന്നതിലൂടെ ചലിക്കുന്ന പ്രതീതി ജനിപ്പിക്കുന്ന പ്രക്രിയയാണല്ലോ അനിമേഷൻ. കാഴ്ചയുടെ ഏത് പ്രത്യേകതയെ അടിസ്ഥാനമാക്കിയുള്ള സാങ്കേതിക വിദ്യയാണിത്?",
    answer: "വീക്ഷണസ്ഥിരത",
    options: [
      "വീക്ഷണസ്ഥിരത",
      "വീക്ഷണപരിധി",
      "വീക്ഷണകോൺ",
      "വീക്ഷണതലം"
    ]
  },
  {
    numb: 7,
    question: "നെറ്റ് വർക്കിൽ ഉൾപ്പെട്ടിരിക്കുന്ന ഉപകരണങ്ങൾ അവയുടെ - നാമകരണത്തിലും വിവരങ്ങൾ കൈമാറുന്നതിലും ചില പൊതു നിയമങ്ങൾ പാലിക്കേണ്ടതുണ്ട്. ഈ പൊതു നിയമങ്ങൾ ഏത് പേരിലാണ് അറിയപ്പെടുന്നത്?",
    answer: "നെറ്റ് വർക്ക് പ്രോട്ടോക്കോളുകൾ",
    options: [
      "നെറ്റ് - മാസ്ക്",
      "സെർവർ നെറ്റ് വർക്ക്",
      "ക്ലൈന്റ് നെറ്റ് വർക്ക്",
      "നെറ്റ് വർക്ക് പ്രോട്ടോക്കോളുകൾ"
    ]
  },
  {
    numb: 8,
    question: "സണ്‍ക്ലോക്ക് സോഫ്റ്റ് വെയര്‍ മെനുബാറിലെ ഒരു ഭാഗമാണ് ചുവടെ നല്‍കിയിട്ടുള്ളത്. ഇതിലെ മാര്‍ക്ക് ചെയ്ത 'ആ' ടൂള്‍ ഉപയോഗിക്കുന്നതെന്തിന് ",
    answer: "സണ്‍ക്ലോക്കിലെ സമയം പിന്നോട്ട് നീക്കുന്നതിന്",
    options: [
      "സണ്‍ക്ലോക്കിലെ സമയം മുന്നോട്ട് നീക്കുന്നതിന്",
      "സണ്‍ക്ലോക്കിലെ സമയം പിന്നോട്ട് നീക്കുന്നതിന്",
      "സൂര്യനെ പ്രത്യക്ഷമാക്കാന്‍",
      "രേഖാംശരേ ഖകളെ പ്രത്യക്ഷ മാക്കാന്‍"
    ]
  },
  {
    numb: 9,
    question: "വെബ്പേജുകള്‍ തയ്യാറാക്കുമ്പോള്‍ html ടാകുകളുടേയും ആട്രിബ്യൂട്ടുകളുടെയും ആവര്‍ത്തിച്ചുള്ള ഉപയോഗം ഒഴിവാക്കാന്‍ ചുവടെ കൊടുത്തിരിക്കുന്ന വയില്‍ ഏത് രീതിയാണ് അഭികാമ്യം.",
    answer: "Cascading Style Sheets",
    options: [
      "Cascading Style Sheets",
      "Web Content management System",
      ".html editors ",
      "Text editors "
    ]
  },
  {
    numb: 10,
    question: "വെബ്പേജ് തയാറാക്കുമ്പോള്‍ താഴെ കൊടുത്തിരിക്കുന്ന വയില്‍ കാസ്കേഡിങ് സ്റ്റൈലുകളായി നിര്‍വചിക്കാവുന്നവ ഏതെല്ലാം?",
    answer: "Linux",
    options: [
      "വെബ്പേജിന്‍റെ ലേഔട്ട്, ഫോണ്ടുകള്‍, നിറങ്ങള്‍",
      "വെബ്പേ ജിലെ ഉള്ളടക്കം",
      "വെബ് കണ്ടന്‍റ് മാനേജ്മെന്‍റ് സിസ്റ്റം",
      "വെബ്പേജ് ദൃശ്യമാക്കേണ്ട ബ്രൗസര്‍"
    ]
  },
  // you can uncomment the below codes and make duplicate as more as you want to add question
  // but remember you need to give the numb value serialize like 1,2,3,5,6,7,8,9.....

  //   {
  //   numb: 6,
  //   question: "Your Question is Here",
  //   answer: "Correct answer of the question is here",
  //   options: [
  //     "Option 1",
  //     "option 2",
  //     "option 3",
  //     "option 4"
  //   ]
  // },
];
